{
  "data": [
    {
      "id": 0,
      "title": "Tata Crucible – The Business Quiz",
      "image": "http://nrinews24x7.com/wp-content/uploads/2016/02/Tata-Crucible-Campus-Quiz.jpg",
      "description": "'Tata Crucible - The Business Quiz' seeks to bring together sharpest young corporate minds in India to take on the heat of the toughest business quiz in India. Youth is a key audience cluster which the Tata Group is focusing its communication at and Tata Crucible is one of the key initiatives towards this engagement. Tata Crucible was started as a key initiative in 2004, a year which was christened as the 'Century of Trust' year to commemorate the death centenary of the Founder of the Group - J.N. Tata and the birth centenaries of two of its illustrious leaders - J.R.D. Tata and Naval H. Tata. It generated huge response as a high quality business quiz in the very first year and has now become an annual event. In a commissioned research Tata Crucible Campus Quiz has been judged highest rated ground quiz by the students of participating colleges. For the first ten years, the Tata Crucible Quiz was held in 3 parts. Two back to back tracks - separately for Tata corporates and Non-Tata corporates, followed by National Finals. The third track is held for Campus students each year also followed by a National Final.Thirteen editions of Crucible corporate version and Twelve editions of the Crucible Campus version have been held so far to enthusiastic response. As the quiz enters in its 13th year now, the quiz is held in 2 parts annually. Corporate edition, where all corporate houses i.e: Tata and non Tata will take part together and the second part would be held for Campus edition for students across India. Both the corporate and campus editions will have respective national finals after the city and zonal rounds.",

      "link": "http://www.tatacrucible.com/",
      "location": "Bhubaneswar",
      "updated_at": "TBD"
    },
    {
      "id": 1,
      "title": "DDM IT QUIZ",
      "image": "http://www.ddmitquiz.com/wp-content/uploads/2018/03/ddmit-logo.png",
  	  "description":"Technology is a curiosity creator. Its depth has no limit and can be explored unendingly. The Debasish Das Memorial IT Quiz (DDM IT Quiz) organised by Mindfire Solutions is a platform for the  inquisitive technical and management students to showcase their knowledge and quench the thirst for information. The DDMIT saga started in the year 2011 with about 100 teams participating and last year it witnessed more than 350 teams from across the country. The overwhelming response led to the IIT Kharagpur edition of the Quiz in 2017.  It is now recognised as one of the largest IT Quizzes at the college level in the nation.",
      "link": "- http://www.ddmitquiz.com/",
      "location": "Bhubaneswar",
      "updated_at": "TBD"
    },
    {
      "id": 2,
      "title": "Udghosh",
      "image": "http://cdn.kiit.ac.in/wp-content/uploads/2018/02/UDGHOSH-2018-A-National-Level-Open-Quiz-at-KIIT.jpg",
  	  "description":"Udghosh is a national level open quiz conducted by Qutopia. Qutopia, the quizzing society of KIIT University, Bhubaneswar was founded in year 2004 as the first student quiz club of Odisha. Qutopia aims to be the perfect utopia for seekers of the art of knowledge, born out of a desire to learn more about the world and beyond as well as to cater to an urge to explore and share the infinite depths of knowledge.",
      "link": "https://www.google.co.in",
      "location": "Bhubaneswar",
      "updated_at": "TBD"
    },
    {
      "id": 3,
      "title": "Under The Peepal Tree",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/79/UTPT_2018_Logo_PNG.png/300px-UTPT_2018_Logo_PNG.png ",
  	  "description":"Under the Peepal Tree (UTPT) is the annual quiz fest organized by RV QuizCorp, the quiz club of RVCE, Bangalore. Under the Peepal Tree 2018 was the 20th edition of the fest. Held between the 23rd and 25th of March 2018, it also celebrated the 20th year of RV QuizCorp's founding, with a new fandom quiz added to the lineup. UTPT began in the year 1998 in Bangalore and as a brainchild of Avinash Mudaliar and Gopal Srinivasan, two of India's most renowned quiz masters. UTPT is indeed Asia’s Largest Quiz fest, for the fact that 7 unique quiz events are held each and every year over a course of 3 days and for the varied demographics it attracts. 6 of the 7 quizzes are for school and college students only, and the other is for all public (all students, corporates and others). UTPT is spread over 3 days consisting of 7 quizzes.",
      "link": "http://www.rvquizcorp.com/",
      "location": "Bengaluru",
      "updated_at": "TBD"
    },
    {
      "id": 4,
      "title": "Landmark Quiz",
      "image": "http://landmarkquiz.in/img/Quiz_banner.jpg",
  	  "description":"Landmark Quiz is an annual quiz contest instituted in 1992 by the Landmark Bookstores owned by Tata Group through its Trent (Westside) brand. Since 2008, the event has been held in Bangalore, Chennai, Delhi, Hyderabad, Mumbai, and Pune on various dates. The quiz is mostly conducted on Landmark Quiz starts with a huge turnout for the quiz preliminary round where participants fill in their answers for about 40 questions that come up on a screen. No negative marking is applied. The quiz is normally set by a team of senior quiz-masters such as Dr. Navin Jayakumar, Gautam Padmanabhan, and Navin's mother, Saranya Jayakumar. It has been hosted by Dr. Navin Jayakumar since its inception with the exception of 2006 when Derek O'Brien was the quizmaster in the absence of the main quizmasters. The quiz is mostly conducted on national holidays, and is one of the oldest open quizzes in India.",
      "link": "http://landmarkquiz.in/",
      "location": "Chennai",
      "updated_at": "TBD"
    },
	{
      "id": 5,
      "title": "Karnataka Quiz Association Quizzes",
      "image": "https://cdn-az.allevents.in/banners/1c3ac3bc96482595e606b2ddfd2a9ec8-rimg-w720-h273-gmir.jpg",
  	  "description":"The Karnataka Quiz Association (or KQA) was founded in 1983 by the late Wing Commander G.R.Mulky, Deepak Murdeshwar, Rajeev Gowda, Thomas Uthup, K.N.Mahabala, Thribhuvan Kumar, P.Raju and Jagadish Raja is a non-profit association devoted to popularizing the mindsport among students and the general public in Bangalore and beyond. Contests are held regularly in the following categories: Middle School, High School, Junior College, College, and Open-to-all. In addition, specialist quizzes in the areas of Literature, Entertainment, Music, Art, Comics and Business are held every yet. The KQA has an informal membership policy. People interested in quizzing sign up to receive a free email newsletter about forthcoming contests. The newsletter goes out to about 2000 people at present. KQA's flagship event, ASKQANCE, is held in the third week of June every year and comprises three quizzes, one each in the School, Corporate and Open Categories. The KQA also holds a solo quiz titled Mahaquizzer as well as a solo quiz event called MindSweep across India's several quizzing cities annually. Since 2003, the KQA has collaborated with the TI Foundation in conducting the Jack Kilby Quiz in Science and Technology for high school students.",
      "link": "http://kqaquizzes.org/",
      "location": "Karnataka",
      "updated_at": "TBD"
    },
	{
      "id": 6,
      "title": "Quiz On The Beach",
      "image": "https://pbs.twimg.com/profile_images/516196221040349184/BU1DZEf2.jpeg",
  	  "description":"Quiz on the Beach® (QoTB®) is Asia’s biggest on-campus quiz, conducted by T.A. Pai Management Institute, Manipal. Having started as an intercollege fest 15 years ago, QoTB® has developed its identity across India and other nations. QoTB® was conceptualized in the year 2004 with the aim of creating a healthy competitive environment in which students from across the world would vie with each other for the coveted QoTB® Champions tag. Besides bringing together the sharpest student minds, it serves as an opportunity for them to interact, network and more importantly, learn from their colleagues in other top institutes. With its roots spread across three countries- India, Singapore and United Arab Emirates, QoTB® has grown exponentially. The latest edition of the quiz, QoTB® 2018, saw over 3000 teams from 3 countries fighting it out for fame, glory and an overwhelming cash reward. The Quiz on The Beach® was held across 10 Indian cities namely Mumbai, Ahmedabad, Chennai, Delhi, Kolkata, Bangalore, Hyderabad, Pune, Manipal and Lucknow. To add on to the royal trail, the international qualifiers were held at Singapore and Dubai. The nationally telecasted show over ET Now enjoys the viewership of over 2 lakh people. QoTB® is hosted by the noted Quizmaster Mr Giri ‘Pickbrain’ Balasubramanium, an avid quizzer himself.",
      "link": "http://landmarkquiz.in/",
      "location": "Chennai",
      "updated_at": "TBD"
    },
	{
      "id": 7,
      "title": "Times Ascent Engineering Mastermind Quiz",
      "image": "https://pbs.twimg.com/profile_images/755007827282845696/u0-mEFgo_400x400.jpg",
  	  "description":"India celebrates 51st Engineer's Day on September 15th to mark the birth anniversary of Sir M Visvesvaraya, the most outstanding Indian Engineer. He was the brain behind Hyderabad's flood protection system and the construction of Krishna Raja Sagara dam in Mysore. His systems are in use till date. He was also honoured with India's highest honour Bharat Ratna in 1955. Times Ascent is commemorating Engineer's day with National level quiz - 'Times Ascent Engineering Mastermind' Times Ascent Engineering Mastermind Quiz, India’s biggest Inter-Corporate Quiz for engineers, in its 7th edition, will be held on 8th & 15th September 2018. It will be a grand opportunity to witness a battle of wits amongst the best engineering minds in the country. TAEM would have Zonal rounds in Mumbai, Bengaluru, Delhi, Chennai, Pune, Hyderabad & Ahmedabad which would culminate in the shortlisted teams competing for the coveted honour in Chennai.",
      "link": "http://www.timesascent.com/aem/index.html",
      "location": "Chennai",
      "updated_at": "TBD"
    }
  ]
}
